//* Сохраняем в константу код ответа «создано»
module.exports.codCreated = 201;

//* Сохраняем в константу код ответа «внутренняя ошибка сервера»
module.exports.codInternalServerError = 500;

//* Сохраним в константу текст ошибки 'Такого пользователя нет'
module.exports.textErrorNoUser = 'Такого пользователя нет';

//* Сохраним в константу текст ошибки 'Такой карточки нет'
module.exports.textErrorNoCard = 'Такой карточки нет';

//* Сохраним в константу текст ошибки 'Неправильно указан логин или пароль'
module.exports.textErrorNoValidEmailPassword = 'Неправильные почта или пароль';

//* Сохраним в константу текст ошибки 'Необходима авторизация'
module.exports.textErrorAuthRequired = 'Необходима авторизация';

//* Сохраним в константу текст ошибки 'На сервере произошла ошибка'
module.exports.textErrorInternalServer = 'На сервере произошла ошибка';

//* Сохраним в константу текст ошибки 'Страница не найдена'
module.exports.textErrorNotFound = 'Страница не найдена';

//* Сохраним в константу текст ошибки 'Введены некорректные данные'
module.exports.textErrorValidation = 'Введены некорректные данные';

//* Сохраним в константу текст ошибки 'Карточка удалёна'
module.exports.textMessageDeleteCard = 'Карточка удалёна';

//* Сохраним в константу текст ошибки 'Можно удалять только свои карточки!'
module.exports.textErrorAccess = 'Можно удалять только свои карточки!';

//* Сохраним в константу текст ошибки 'Такой пользователь уже существует!'
module.exports.textErrorConflict = 'Такой пользователь уже существует!';
